{
    "name": "Justin Welsh",
    "header": "Building my one-person business to $10M in revenue. Posts and articles about the process.",
    "location": "New York City Metropolitan Area",
    "about": "Over the last decade, I helped build two companies past a $1B valuation and raise over $300M in venture capital. Then, in 2019, I burned out.So, I decided to walk away from my high-paying executive job.But, before I could, I had a hypothesis.I believed building an audience online would be an incredible asset. That attention was the new currency and would play a major part in my success as an entrepreneur.So, I started building my brand on LinkedIn in early 2019. And the results were pretty phenomenal.In just 6 months I grew from zero followers to over 20,000.And on August 1st of 2019, I walked away from my executive role at a fast-growing startup.Since that day, I've spent my time building a number of one-person Internet businesses.My mission is to be the \"Diversified Solopreneur.\" My results:→ $6.7M+ in business revenue at a 90% profit margin.→ 550K+ people following my journey on LinkedIn→ 475K+ people following my journey on Twitter→ 215K+ people read my weekly newsletter→ 600M+ impressions in the last 4 yearsIf you want to learn more about how I did this, you can take one of my self-guided courses.THE OPERATING SYSTEM DIGITAL COURSEIn this 120-minute course, you will learn the complete LinkedIn operating system that I used to grow from 0 to 500k followers and earn $6.7M+ in income with zero advertisements. Join 20,000+ students and 40 LinkedIn Top Voices in the #1 rated LinkedIn course in the world.→ GO HERE: www.TheOperatingSystem.coTHE CONTENT OS DIGITAL COURSEIn this 85-minute course, you will learn the 8-part content creation machine behind 600M+ impressions on LinkedIn and Twitter, and building a 200,000+ subscriber newsletter. If you're looking for systems to produce 10-15 pieces of high-quality written content every single day, this is the course for you.→ GO HERE: www.justinwelsh.me/the-content-osEmail: support@justinwelsh.meX: @thejustinwelsh",
    "posts": [
        {
            "post": "My digital product, The LinkedIn OS, just enrolled its 22,500th student 🎉I'm not only proud of that student number.I'm proud of the thousands of wins students have racked up in the past 2+ years.Take, Ryan Musselman for example.When he started taking LinkedIn seriously in early 2023, he had a clear vision:Build a successful content agency here on the world’s most powerful B2B platform.Trouble was, he didn’t know the “how.”He knew he needed to nail LinkedIn to attract high-quality clients in his niche organically, but how do you get started?That’s where my LinkedIn OS came in.He absorbed the material and got to work.Fast forward to today, and Ryan’s running a thriving 6-figure agency.He successfully leveraged LinkedIn to attract the type of clients willing to pay top dollar for his services.That’s the power of getting this incredible platform \"right\".And with the LinkedIn OS, I’ve figured out that “Done right” part for you. You just need to execute.Ready to use LinkedIn to grow your business like Ryan did?Learn more about the exact system he (and 22,500+ students) used to build their businesses: https://lnkd.in/efzrVh7jGood luck out there.",
            "comments": []
        },
        {
            "post": "My digital product, The LinkedIn OS, just enrolled its 22,500th student 🎉I'm not only proud of that student number.I'm proud of the thousands of wins students have racked up in the past 2+ years.Take, Ryan Musselman for example.When he started taking LinkedIn seriously in early 2023, he had a clear vision:Build a successful content agency here on the world’s most powerful B2B platform.Trouble was, he didn’t know the “how.”He knew he needed to nail LinkedIn to attract high-quality clients in his niche organically, but how do you get started?That’s where my LinkedIn OS came in.He absorbed the material and got to work.Fast forward to today, and Ryan’s running a thriving 6-figure agency.He successfully leveraged LinkedIn to attract the type of clients willing to pay top dollar for his services.That’s the power of getting this incredible platform \"right\".And with the LinkedIn OS, I’ve figured out that “Done right” part for you. You just need to execute.Ready to use LinkedIn to grow your business like Ryan did?Learn more about the exact system he (and 22,500+ students) used to build their businesses: https://lnkd.in/efzrVh7jGood luck out there.",
            "comments": [
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "All three courses of yours are the best ones I've ever come across (and I've bought many over the last 10 years), Justin. They have helped me write content for myself and my clients."
                },
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Been following him for over a year. One of the most amazing people here....is Ryan Musselman Congratulations on 22500!Justin Welsh"
                }
            ]
        },
        {
            "post": "An interesting observation about business:  The harder you push for sales...  ...the less you earn.  When you have fun online, spend time helping people achieve their goals, and invest in your own growth, revenue goes up.  Turns out this is a real thing:  'The Law of Reversed Effort'  Here's how I'd recommend overcoming it: https://lnkd.in/eJn9fi7V  Have you ever felt this yourself?",
            "comments": [
                {
                    "author": "Kevin Kermes",
                    "comment": "We tell clients in our programs all the time...\"Stop looking for jobs. Start looking for problems to solve.\"That is always a target rich environment."
                },
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "In a dynamic market -> more passion -> learning -> improving your value -> results in better sales.Improve your own value. Comes only with enjoying what you do.Justin Welsh"
                },
                {
                    "author": "Jane Jackson",
                    "comment": "It’s so true - providing a solution that someone wants does not require sales - it requires an awareness of the problem and how you can solve it. There are many ways to create awareness and a cold sales approach is not the best way to develop the first step towards a sale. Especially in a coaching environment where rapport and trust take time to develop."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "The crazy thing is that even after spending so many years in business, it's easy to fall prey to that mindset. Thank you for the constant reminder, Justin."
                },
                {
                    "author": "Sahil Bloom",
                    "comment": "Great advice. Solve a big enough problem for people and money will take care of itself."
                },
                {
                    "author": "Tom Alder",
                    "comment": "thanks for sharing Justin Welsh! switching gears from just chasing money to bringing value and growing personally sounds like a solid plan for success"
                },
                {
                    "author": "Deirdre Martin",
                    "comment": "Spot on! I've definitely found that focusing on building relationships and adding value comes back tenfold compared to a hard sales approach."
                }
            ]
        },
        {
            "post": "All your eggs in one basket is a recipe for disaster.  Diversify with a portfolio of projects.  And as you figure out what works, stack them on top of one another to de-risk your earnings.  Here's how: https://lnkd.in/eqT-MAiy",
            "comments": [
                {
                    "author": "Justin Welsh",
                    "comment": "Side note: This doesn't mean you have to rush out and build a bunch of stuff all at once. Approach them in a logical order as you learn more about your customer base. Different price points, different learning styles, different products/services, etc. Slow and smart approach."
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "100%You wouldn’t dump all your investments in one stock or asset class…Why do that with your revenue?"
                },
                {
                    "author": "Anshuman Tiwari",
                    "comment": "Applies to salaried people as well. 😊"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh diversify!"
                },
                {
                    "author": "Marc C. Angelos",
                    "comment": "The riskiest thing you can do is NOT take the risk…."
                },
                {
                    "author": "Jennifer Welsh",
                    "comment": "Like index funds"
                },
                {
                    "author": "Sk Moni",
                    "comment": "Justin Welsh Don't be a one-trick pony!"
                },
                {
                    "author": "Hassan Bin Arshad",
                    "comment": "It's about numbers and leverage"
                },
                {
                    "author": "John Kraski",
                    "comment": "Love this Justin Welsh! It's exactly what I'm doing as we speak. The portfolio approach never gets old. Great advice as always. Happy Sunday!"
                },
                {
                    "author": "Shane Arthur",
                    "comment": "Build a portfolio of relationships, interests, and activities that bring you joy. A life truly worth living."
                },
                {
                    "author": "Darren McKee",
                    "comment": "yes, some will fail, some will be flat, a couple will 10X"
                },
                {
                    "author": "R Dilip Kumar",
                    "comment": "This applies to pretty much everything. Isn't it Justin Welsh?Putting all of your email subscribers in one autoresponder.Hosting all your websites with one hosting provider etc.I have faced the downsides of doing this. I learnt it the hard way.And when it comes to income channels.. absolutely.. it is a huge risk to put everything in one basket..!"
                }
            ]
        },
        {
            "post": "Everyone should have a side project that earns $150+ per day.Here are 4 simple examples I love:1. Building a service-based business2. Creating a digital course3. Starting a paid community4. Creating a subscription emailI break down these 4 examples in a recent newsletter issue:- The pros- The cons- The techAnd more...Read it here: https://lnkd.in/e9SsdZMg",
            "comments": [
                {
                    "author": "Jeff Frick",
                    "comment": "I'm in."
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh you are more than just work, passions and hobbies too"
                },
                {
                    "author": "Mike Romaine",
                    "comment": "Digital courses are the ultimate freedom hack. 🙌🏼"
                },
                {
                    "author": "Drew Williams",
                    "comment": "Subscription email is a great one. Utilizing LinkedIn newsletter is a great option to help scale it."
                },
                {
                    "author": "Craig Davis",
                    "comment": "A side project can help serve the community.1. A service based business plan to help people who are behind you will benefit.2. There are 4 examples and they are all available to take action on.3. Paid communities can let you find and develop your community and answer questions.P.S. Thank you for sharing 4 side project examples, Justin."
                },
                {
                    "author": "Roger Mark Thompson💡",
                    "comment": "Justin Welsh subscription email is a fruitful path. The $150 target is an interesting number, how did you land on that?"
                },
                {
                    "author": "Elena Georgieva",
                    "comment": "You don't need to break the bank to start a business"
                },
                {
                    "author": "Daniela P.",
                    "comment": "All 4 ideas are great, however, I love the course idea as people can buy it anytime and one also builds authority and brand at the same time, builds a community, not to mention it doesn't require continuous involvement. In these uncertain times, a passive income is a must for everyone. Thanks for sharing."
                },
                {
                    "author": "Hassan Bin Arshad",
                    "comment": "Starting with a service based business is the easiest and possibly the best way to go about itEverything else gets easier when you experience this Justin Welsh"
                },
                {
                    "author": "Victor Odey",
                    "comment": "Today's issue will be exciting 📖🖋️And actionable"
                },
                {
                    "author": "Zack Enriquez",
                    "comment": "Service business would be the one I’d recommend. Overhead is so low and you can often find your first client to build a case study with from your own network. No hard selling needed."
                },
                {
                    "author": "Ali Raza Imran ⭐️ SEO Specialist",
                    "comment": "Loved this one I am gonna apply these all. Worthy to follow Justin Welsh"
                }
            ]
        },
        {
            "post": "\"Hustle 24/7\" is silly.  But, so is staying stagnant.  The best entrepreneurs skip both of these mindsets.  Instead, they are always moving forward methodically.  Because the moment you let your guard down?  Someone is there to replace you.  Don't be replaceable.  Be agile. Be moving. Be thinking ahead.  And be aware of what awaits you.  Here are the 5 most common phases to be on the lookout for: https://lnkd.in/e4cpBhCe  Good luck out there.",
            "comments": [
                {
                    "author": "Jeff Frick",
                    "comment": "Like a sharkMoving forward, or sinking"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Loved the driving analogy, Justin. 🔥 It's just so perfect.- You know the destination, but must focus on the road ahead.- You know how to get there, but must BE in the present.- You need to have the car (systems) in good condition.It's the mindset & agility that gets you to the destination in both cases."
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "A little, consistent movement in a specified direction goes a long way.1% = 37xBut you must compound, daily.Choose wisely."
                },
                {
                    "author": "Maury Rogow, CEO",
                    "comment": "Exactly! Like Martin Luther King said: “If you can't fly then run, if you can't run then walk, if you can't walk then crawl, but whatever you do you have to keep moving forward.”Entrepreneurs need go non-stop, and define a clear strategy to stand out from competition. Justin Welsh"
                },
                {
                    "author": "Jeff Frick",
                    "comment": "Look through the banners of the people commenting on this post.Justin, Looks like they were paying attention and putting best practices in play. hashtag#ABC"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh method over abruptness"
                },
                {
                    "author": "Semir Sakanovic",
                    "comment": "Always keep moving. And don't overthink much. Overthinking will slow you down. Justin Welsh"
                },
                {
                    "author": "Fran Callado",
                    "comment": "Always growing and adapting! Because neither us nor our business will continue growing in 1 year from now if we haven't adapted to the changes in the marketplace."
                },
                {
                    "author": "Yehor Fedorov",
                    "comment": "Living at full throttle 24/7 without any breaks is like running on a treadmill non-stop. Eventually, you'll either burn out or exhaust yourself completely."
                },
                {
                    "author": "Shaun Gordon",
                    "comment": "It's about finding a pace that's both ambitious AND sustainable. Justin Welsh"
                },
                {
                    "author": "Anthara F.",
                    "comment": "It's crucial to maintain a proactive mindset in the dynamic world of entrepreneurship. Always staying alert and thinking ahead can help you stay ahead of the curve. Thanks for sharing these valuable insights on the common phases to watch out for. Wishing you continued success on your journey Justin Welsh!"
                },
                {
                    "author": "Logan D. Freeman",
                    "comment": "The way to continue to move forward is buy setting objectives and goals, hitting those and letting those become your new baseline"
                }
            ]
        },
        {
            "post": "An interesting observation about successful people I know:  Building their awesome life started with being 100% unapologetic about wanting one.  You don't need anyone's permission to do incredible things.  Here are 5 rules to build your permissionless life: https://lnkd.in/enwD5uJA",
            "comments": [
                {
                    "author": "Jeff Frick",
                    "comment": "hashtag#NoPermissionNeeded"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "True. And as they say, with great power comes great responsibility.As a solopreneur, you're 100% responsible for:- the decisions you take- the results you get- your businessAnd this realization makes you more committed, more honest, and more resilient.So, being a solopreneur is not just a benefit, it's a privilege.Justin Welsh 🔥"
                },
                {
                    "author": "Andrew Stafford",
                    "comment": "Be ambitious.Be unapologetic.Be deserving of the pursuit.You have the power to build the life you want. Go do it."
                },
                {
                    "author": "R Dilip Kumar",
                    "comment": "Practical tips Justin WelshIt is true that everyone of us programmed to take that safer route. It is not just the US but pretty much everywhere IMO.Study > get good grades > get into a good college > earn a degree > get a job > slog it out until you are 60 > live on your pension..That's conventional wisdom.People who broke away from that and did things differently are the ones who have succeeded.Irrespective of what you want to do - work a 9 to 5 or, start a business - all of those 5 points apply to you..The time now is to invest in yourself and scale up so that you can enjoy what you are earning and live a life that you is fulfilling.."
                },
                {
                    "author": "Brian Wcislo",
                    "comment": "Granting myself permission 🙌"
                },
                {
                    "author": "Ekene Franklin",
                    "comment": "I remember when I always asked for permission from my family members & friends before I started anything, sometimes they told me not to start and I listened neither did I know that they were holding me back from who I wanted to be."
                },
                {
                    "author": "Zayden N",
                    "comment": "Don't build a personal brand.Build a freedom brand.Freedom to work with anyone.Freedom to see your parents often.Freedom to wake up when you want.Freedom to go on a vacation on Monday.Freedom to spend most time with your kids.Freedom to spend more time with your partner.Freedom to go to the gym on Tuesday noon.Freedom to decide when you want to work.Freedom to take a walk at 3 pm in nature.Freedom to play golf on Wednesday.Freedom to work from anywhere.Freedom is the main goal, brand is just a byproduct of it."
                },
                {
                    "author": "Chioma Ekene-Obioha 💝",
                    "comment": "Well said.You need to be unapologetic in wanting a comfortable life and scaling up.Wanting more is not a bad thing.It's just a way to  say I'm not comfortable where I am and want to build.No one cares whether you succeed or not, So you don't need their permission to do amazing things.Just do what you love and build to become successful.I love this Justin Welsh"
                },
                {
                    "author": "Sam Browne 🦖",
                    "comment": "Here's the thing.We're conditioned to think:- You must work hard forever. Sorry.- Your job is going to suck. Sorry for that too.- You'll work for 40 years (at your terrible job).- Then you'll die.We are not told:- The internet is actually f***ing awesome.- You can do anything you want.- There is unlimited money.- There are unlimited customers.- You're living in the best time in historyYou can be a creator on any topic you're interested in.You can build a million dollar business.Want to play video games all day? That's fine. ✅Want to get paid to travel? Ok, you can. ✅Want to teach people how to cook, or how to draw, or how to dance the hoochy coo? No problem. ✅It starts with changing your mindset. 🧠Change your mind, and you can change your life."
                },
                {
                    "author": "Rui Pedro Duarte",
                    "comment": "Embrace your ambitions boldly—permission to achieve greatness is granted by none but yourself."
                },
                {
                    "author": "Yehor Fedorov",
                    "comment": "You have everything you need to get started. Let this be your story, not a story about how you waited for someone to give you the green light."
                },
                {
                    "author": "Kamran Ali",
                    "comment": "It's an Independence and freedom that is the main reasons for my happiness.You have to find a reason to make yourself happy.All I am doing is because of freedom.The end goal is satisfaction and Happiness."
                }
            ]
        },
        {
            "post": "Are you optimizing for money or life?One will burn you out.One will energize you.I challenge you to find one area of your life or business where you can slow down and be more intentional.Start small, but start today.More here: https://lnkd.in/ef78YkeA♻️ Reshare this if you choose life.",
            "comments": [
                {
                    "author": "Jeff Frick",
                    "comment": "Or as I like to say... Don't forget your death bedWhat will you have wish you had done more ofand less of?"
                },
                {
                    "author": "Bobby Umar",
                    "comment": "When you optimize your time, you will find that you are actually optimizing your relationships, far more than the money."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "The funny thing is when you optimize for life, money follows. The challenge is to act on the realization, by letting go of peer pressure, FOMO, and wrong priorities.Justin Welsh"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh optimize for life, optimize your life."
                },
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "I guess my simple conclusion is that you can't get enough of money but if you live well, you feel you have enough. Stopping comparisons is the first step.Apt reminder there Justin Welsh"
                },
                {
                    "author": "Christopher Regnier",
                    "comment": "Build the life YOU want.Not what Mommy wants.Not what the Joneses want.Not what Mr. Insta Lamborghini wants.YOU are the one who has to/gets to wake up to your life on a Monday morning.YOU are the one who will stand on the mountain tops & trudge through the dark valleys.So YOU are the one who needs to decide what's worth it."
                },
                {
                    "author": "Yehor Fedorov",
                    "comment": "Start small, but start now. Don’t delay.Waiting for the “perfect moment” is like waiting for a bus in a field.It will never come."
                },
                {
                    "author": "Andria Younger, MA",
                    "comment": "Justin Welsh.  Many professional speakers \"case the cash\" and burn out.  This is why I focus on growth strategies to optimize life.- revenue streams that don't require getting on a plane- you have the freedom to work anywhere in the world- keep things simple"
                },
                {
                    "author": "Noga Hillel 🏆",
                    "comment": "Creating a good life should be the focus. Money is one of the many tools that require to create a good life, Justin Welsh."
                },
                {
                    "author": "Pritesh Patel",
                    "comment": "Optimizing for life gives you what optimizing for money won't - peace, content, and well-being."
                },
                {
                    "author": "Sachin B",
                    "comment": "Small changes can make a big difference. - Delegate- Automate- Eliminate tasks that drain your energy."
                },
                {
                    "author": "Mritunjay Kumar Yadav",
                    "comment": "Focus on the process of life,Money should be the byproduct!Justin Welsh"
                }
            ]
        },
        {
            "post": "Your LinkedIn profile is your digital sales page.But on a crowded platform with over 600M users......you *must* make the right impression for it to be effective.I see too many profiles that fail to communicate:- What the person does- Who they’re supposed to help- The outcome they’re trying to provideDon’t make the same mistake.Optimize yours to attract followers, engage your audience, and convert them into loyal customers.Here’s how: https://lnkd.in/e2-QJdB6If you found this infographic helpful, reshare ♻️ it to help others.",
            "comments": [
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Your LinkedIn profile is the best free real estate you can get on any Social platform! We need to make it valuable. Detailed infographic Justin Welsh"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Also, your LinkedIn profile is:- your business card and resume bundled into one- it works for you 24x7 w/o your presence- should answer WIIFM of your TAThat's why the first thing ever to do on this platform is to set it up the right way.Justin Welsh"
                },
                {
                    "author": "Kevin Chiche",
                    "comment": "99% of TAGLINES suck because you make it all about you, your achievements, your titles.Nobody gives a shit about you.Everybody cares about themselves.Your \"i help\" statements are egotistical.Your \"im the _____ guy\" is self absorbed.Instead, start with power verbs:- get- make- learn- unlock- etc.And then talk about their desire.Make it about THEM. not about you.Connect with your people. Fastest way to success"
                },
                {
                    "author": "Peter Sleightholme",
                    "comment": "And the most critical part of your profile?Your HEADLINE: Because your headline drives traffic to your profile ...So, it must be a WIIFM-benefit-rich, outcome-focussed transformation statement, all in just 51 characters (including spaces) 😊- Most people will first see it in your comments and replies.- Its often the first (and could be the only) impression people get of you.- It’s the most valuable advertising real estate for you and your personal brand on LinkedIn.- So, get straight to the point.- Because people care only about what you can do for them.- And this must be crystal clear and simple in your headline. 😊"
                },
                {
                    "author": "Attila M.",
                    "comment": "Justin, LinkedIn exceeded 1 billion users during 2023"
                },
                {
                    "author": "Ekua Cant",
                    "comment": "Your LinkedIn profile is your personal shop window on LinkedIn. So it's always best to make it: 🌟Attractive 🌟Provide a lead magnet/newsletter 🌟Use your banner to alert people of who you are or your offer. There are now 1 Billion users on LinkedIn, so there's plenty of opportunity for all. I  💯 agree that you do need to optimise your profile! 😍 😍 🙌🏾🙌🏾😍 😍 🙌🏾🙌🏾😍 😍 🙌🏾🙌🏾😍 😍 🙌🏾🙌🏾😍 😍 🙌🏾🙌🏾"
                },
                {
                    "author": "Lou Magnotti",
                    "comment": "Curious to see what you think of mine?"
                },
                {
                    "author": "Edvin Vosylius",
                    "comment": "What about # do they still work on Linkedin?"
                },
                {
                    "author": "Jose-Andres Camacho",
                    "comment": "Thanks for sharing. This is a solid playbook, Justin. What’s the role of websites today in your opinion with social platforms like LinkedIn, Facebook, and Instagram becoming more sales and conversion focused?"
                },
                {
                    "author": "Swati Agarwal",
                    "comment": "Be clear. Be real.Be kind.Be genuine."
                },
                {
                    "author": "Surabhi Shenoy",
                    "comment": "Great reminder! An optimized LinkedIn profile is crucial; it’s our personal billboard to the professional world. Clearly articulating who we are, what we do, and the unique value we provide can transform a profile from just another page into a compelling brand story."
                },
                {
                    "author": "Edward Serwanja",
                    "comment": "As businessmen, clarity always has to be one of our priorities.A good profile has to take a reader or visitor at least 5–10 seconds to understand what you do and how you can help them.A well-written profile has to be simple. and clear, whereby the reader can understand everything without any help."
                }
            ]
        },
        {
            "post": "Promote yourself.Nobody else is going to do it for you.Here's how: https://lnkd.in/efc3FSYV",
            "comments": [
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Everyone's 100% ignorant about you when you start. And then the magic happens with consistently being out there, experimenting, learning and growing. Better to create a recall (over time) for yourself than not be known at all.Justin Welsh"
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "100%You have a brand whether you’re consciously creating it or not…You’re a business of one, whether you think you are or not.Might as well drive."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Talking about your wins and failures (and so the value your bring in) is an AWESOME way to promote yourself subtly, Justin."
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh acknowledge your work"
                },
                {
                    "author": "Keith Bollig",
                    "comment": "Justin Welsh when I first heard you say to post and respond to other's posts daily, I was hesitant thinking it wasn't a valuable use of time. But, because I respect the work you are doing, I made time and started doing both. I approached it thinking it may help others. It has been richly rewarding to help others.   It aligns perfectly with my calling to serve others in their business growth journey. It's more than self-promotion, it's about contributing value to our community. Thanks for what you do to support the creator economy."
                },
                {
                    "author": "Edward Serwanja",
                    "comment": "This post has reminded me of a giant beverage and food company called Coca-Cola.Despite the fact that it's a widely known company everywhere, it never stops advertising.It collaborates with influencers, events, ads,ads etc.They know that the money is in marketing.People always need to be reminded."
                },
                {
                    "author": "Mando Sallavanti III, CFP®, CEPA, CLTC®",
                    "comment": "Nobody will push for you more than you will.I run my financial planning practice at a fortune 100 company. They don't give me prospects. They don't promote me.But it ISN'T THEIR JOB.They give me the resources I need.It's on ME to take action."
                },
                {
                    "author": "Ryan R. Sullivan",
                    "comment": "\"Isn't it selfish to post content?\"It's selfish NOT to post content that can help people."
                },
                {
                    "author": "Keith Bilous",
                    "comment": "It's that consistent presence that builds familiarity and trust in you and whatever you're offering to the world. Confidence in yourself begins with yourself. Period. Justin Welsh"
                },
                {
                    "author": "Andria Younger, MA",
                    "comment": "Justin Welsh. Promotion is not about pushing yourself but sharing your personal experiences and knowledge to help others."
                },
                {
                    "author": "Dan LeFave",
                    "comment": "You’re right, we have to express our unique wisdom or let it die inside."
                },
                {
                    "author": "Vipin Gautam",
                    "comment": "Promoting oneself is essential for reaching goals and making an impact."
                }
            ]
        },
        {
            "post": "Life shouldn't revolve around building a business.  Business should revolve around enriching your life.  The real question we should ask ourselves is not, \"how big can we get?\"  But instead, \"what kind of life do we want to live?\"  The magic happens when we shift our focus from size to significance.  You might discover that your 'enough' is a lot less than you thought.  Because we’re conditioned to believe that 'more' is somehow synonymous with 'better'.  But often, it's just synonymous with more stress, more time away from family, and more sacrifices.  Maybe it's time you redefine 'enough'?  Maybe 'enough' is working on something you genuinely enjoy, serving customers who truly appreciate your product, and having time to spend with your family and loved ones.  I'd encourage you to challenge your own notions of 'enough'.  Because your existence isn't a business plan waiting to be scaled.  ~~~  This is an excerpt from, \"When is enough, enough?\"  You can read my full essay here: https://lnkd.in/ej4GgV4G  Feel free to reshare if you enjoy it.",
            "comments": [
                {
                    "author": "Louie Bernstein",
                    "comment": "Working from 7am to 7pm isn’t productivity. It’s guilt.I learned this the hard way."
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "Starting the BE-ing and then move to the DO-ing.Most people go about it the other way around.That’s why many miss the mark and remain unfulfilled.Thanks for the reminder, Justin. 🙏"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh couldn't agree more, build something that supports your life."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Starting with the end in mind is a great way to build a business.After all, it's your business to live a life worth enjoying.Start with the WHY, and figure out the HOW.Justin Welsh 🔥"
                },
                {
                    "author": "Nitish Rana",
                    "comment": "Progress > PerfectionBetter > Enough"
                },
                {
                    "author": "Christopher Regnier",
                    "comment": "He who knows Where he wants to go is much more likely to get there (and like it when he does)."
                },
                {
                    "author": "Mark Franklin",
                    "comment": "Greater wealth, greater headaches when it reaches past what is \"Enough\" and falls into the \"More\" mindset. I've seen it with many people who kept pushing to get bigger.  The toll it takes on - Health- Relationships- State of mindMore money doesn't equal more peace."
                },
                {
                    "author": "Colby Kultgen",
                    "comment": "You can make a massive impact without sacrificing your wellbeing in the process."
                },
                {
                    "author": "Nejc Jamscek",
                    "comment": "If you start the wrong way then it is hard to change it in the middle, Justin Welsh"
                },
                {
                    "author": "Swapratim Roy",
                    "comment": "There’s an old chinese proverb - “if a business does not run for 100 years, it’s not a real business”. This explains a deeper meaning on how to build and raise a family with values to run something like business for a longer run, for generations. That should be the goal to build a prosperous life. What do you think Justin Welsh ?"
                },
                {
                    "author": "Tiffany Ogwumike",
                    "comment": "I have never seen a person regret doing what they love. We should shift our mindset from thinking SIZE to thinking SIGNIFICANCE."
                },
                {
                    "author": "Jake McCoy",
                    "comment": "I know it sounds small but I can be VERY happy with only $6K a month. That covers bills for my family and slowly makes my life better. I am not aiming to work so hard that I lose sleep or missing out with my family. I have to clear $10K a month to cover “Uncle Sam’s Taxes” that is it. Who else can say that? Not many ✌️"
                }
            ]
        },
        {
            "post": "Today is my 2,000th consecutive day posting on LinkedIn.This sort of consistency is only possible with 3 things:Systems, processes, and the tools that enable them.Taplio has been my go-to tool for planning and publishing my LinkedIn posts weeks in advance.My process works like this. 1. Use Taplio’s analytics to see my top posts from the last 30 days.2. Recreate them from a different angle. (new hook, copy, etc.)3. Auto-schedule my first comments/side notes.4. Schedule the post at a time I’ll be online.5. Show up and chat with followers. Because growing on LinkedIn isn’t about publishing a perfect post every once in a while.It’s about showing up with content that’s fundamentally useful for a given target audience — day in and day out, time after time.And while you can try it by hand for a while, you’ll quickly realize that consistency without the right tools is an uphill battle.I've partnered with my friends Tom and Tibo over at Taplio to offer my followers a 14-day free trial of the best solution for being consistent on LinkedIn.Try it risk-free here: https://lnkd.in/edjGgnjd ~~~  ✍️ What's your best process/system?♻️ Reshare to help others on the platform.",
            "comments": [
                {
                    "author": "Justin Welsh",
                    "comment": "P.S. you don't need to write for 2,000+ days to make a difference. Try 30 days. Try 90 days. Just start and don't stop."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "100%! Using systems, tools, and processes allow you to:- Bring predictability into content creation & distribution.- Maintain quality even during \"creativity-dry\" days.- Allocate more time to engage in Comments.Congratulations on day#2000, Justin. 🔥 And thank you for the courses and content that's helping us build our own systems."
                },
                {
                    "author": "Kevin McDonnell",
                    "comment": "IMO Justin Welsh, growth comes from becoming a reliable source of valuable content - the place people turn to for insights that solve their specific problems."
                },
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Systems -> disciplineProcesses -> structure Tools -> efficiency Consistency -> all 3 of the above are working in sync.Wow to 2000 Justin Welsh"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh discipline and consistency"
                },
                {
                    "author": "Dr. Michael Mackney",
                    "comment": "I used to think systems were boring since it was the same thing over and over.But the success that comes with doing that same thing over and over is the most exciting thing ever"
                },
                {
                    "author": "Terry Rice",
                    "comment": "Consistency is the only cheat code! Who else is with me on this one?"
                },
                {
                    "author": "Jason Anderson",
                    "comment": "Tell me it gets easier, though! 😁I’ve never been a social media guy but the scope of influence is just too great to ignore anymore. I’ve purchased your content systems and they’ve been immensely valuable. Now I just need to get out of my head and start getting active. Today’s goal is to comment to some posts, hopefully contribute value to the conversation, and ultimately get more comfortable talking to strangers in this virtual community 😂Thanks, Justin Welsh"
                },
                {
                    "author": "Emile Languepin",
                    "comment": "Curious if you keep yourself a database of all your posts, engagement, etc, as well ?Or if you started and managed it with ready to use tools like Taplio ?I feel it could be a solid safety to have that system, to be able to convert content to long-form, video, etc ?"
                },
                {
                    "author": "Lara Acosta",
                    "comment": "What an INSANE streak!!!"
                },
                {
                    "author": "Justin Jay Johnson",
                    "comment": "Justin Welsh no issue with engagement drop off using a 3rd party scheduler? I’ve heard it’s bad for the algo."
                },
                {
                    "author": "Sahil Bloom",
                    "comment": "2,000 days in a row is no joke."
                }
            ]
        },
        {
            "post": "Layoffs continue happening in the tech space.  People are getting cut at Apple, Checkr, AWS, and more.  And by now, we've all seen the infamous Cloudflare and Discord 'firing videos'.  I think these serve as good reminders to 'bulk up' your personal portfolio.  If we're headed for layoffs, remember to give companies an obvious reason to choose you over other candidates.  One of the easiest ways to do this is to show off how your brain works.  How you think.  - Write useful content - Build small, helpful products - Record videos of your skills and talent - Be active where the decision makers are  Anything!  Any time you can show that you're uniquely talented, you have a better chance at standing out.  Paint? Share your paintings. What's a lesson you learned?  Write? Share it online. Talk about a great experience you had winning a deal.  Run a basketball camp? Talk about what you learned from the kids that helps you as a leader.  Get yourself out there, grab that microphone, and make yourself known to the world.  When it comes time to stand out, you'll have a leg up.  If you don't know how to start, here are 7 steps anyone can action to build a top-tier personal brand: https://lnkd.in/eNm8JTmP  Start today.  ~~~  ✍️ How are you differentiating? ♻️ Reshare if you feel this message.",
            "comments": [
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Personal Branding is a must now.The only investment that never gives a bad return, if you keep at it. That's how you can be more visible than others to potential recruiters / employers.Justin Welsh"
                },
                {
                    "author": "Jonathan Fields",
                    "comment": "So agree. Becoming known for the right thing to the right people gives you portable demand, agency and autonomy. Challenge is, for many people, they’re so fragmented that it’s difficult to home in on what that right thing is. Of the countless things they’ve done, which do you build that brand around?Focusing on the sweet spot between what makes you come alive and what you’re highly competent is a great starting point. This helps ensure you build credibility in an area that not only spotlights your capabilities, but also creates opportunities to do more of things you actually want to be doing."
                },
                {
                    "author": "Jane Jackson",
                    "comment": "Positioning yourself as aSolution to the problems of your target audience is the best strategy - through content creation, publishing, becoming “Google-able” and being clear about who you are and what you can do is the best start when looking for a job.Great tips Justin Welsh"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "There's no escape.The least risky way is to bet on yourself.Showcase (subtly) your expertise to earn trust & authority.That's the best way to attract opportunities even as they dwindle.Justin Welsh"
                },
                {
                    "author": "Swati Agarwal",
                    "comment": "Build yourself.LiveReadWritePostAdd value"
                },
                {
                    "author": "Brian Wcislo",
                    "comment": "How do you make it where I want to click on every one of your links?!Damn you're good at this game Mr. Welsh ;)Keep the fire coming."
                },
                {
                    "author": "Eugene Matvejev",
                    "comment": "this is about UK:I remember when people told in LinkedIn in 2024 there will be no lay offs, I told them there will be, I hate that my predictions were correct.but currently, if you live in UK, and you work in tech or other relative well paid industry, unless you are employed by FAANG or in very well-paid, very senior position, and where company is not willing to move you to EU, there is no value to be in UKhigh paid jobs require productivity, UK tax system disincentivized you to work harder, from removing you from schemes such as childcare, housing etc,for example, most government schemes with 'affordable housing/renting' capped with 90K income. no childcare.100-125K your effective tax is 65%if you loose your job, government will not help you.safety? healthcare? environment? freehold? dignity in living?taxes? we love them, we take them before you are even get paid. we take it 3 times, when you get paid, when you spend, when you pass wealth to your next kind.oh, you have student dept?. extra blow! 15% deductionoh, if you are migrant on visa? extra blow, NHS surcharge!"
                },
                {
                    "author": "Jonathan Stark",
                    "comment": "One of my few regrets in life was not starting an email list while I was at my cushy corporate IT job in the late 90s and early 00s. It would have been SO easy. I had mostly automated my job and had loads of free time. Instead of building a list, I played video games with the other IT guys. It was super fun, but I can't say it paid off... I'm not exactly a professional Unreal Tournament player now LOL!"
                },
                {
                    "author": "Rama Krishna Rao",
                    "comment": "I don't have to comment for the sake of commenting as I am already on this way... oh, did I just comment and told everyone that I am in progress?  ... 🤔"
                },
                {
                    "author": "R Dilip Kumar",
                    "comment": "These doesn't look too good!Layoffs are indeed happening. A lot of the criteria is not related to talent or, performance. At least I know of many such cases.So, showcasing your talent (in whatever domain you are) might increase the probability of getting you a new job, but might not necessarily help you retain your current job.Long back one of my mentors had told me a story about a \"spare-tyre\"..I saw a biker pushing his punctured bike. The rear tyre had gone flat and he was struggling to push it.My mentor asked me, \"Do you know what will happen if you car did not have a spare tyre?\"I looked at him shockingly and said, \"You are stuck. Because you won't even be able to push it like that biker.\"He replied, \"Exactly!\"\"Things that cannot be pushed easily, needs a spare tyre. Lest you will struggle\", he said.\"Life is not easy and pushing can be extremely difficult if your tyre goes flat. Then why do we not keep a spare tyre!\"That question is something that needs to be answered by every one of us who are the mercy of managers for their tomorrows."
                },
                {
                    "author": "Srajika Gupta",
                    "comment": "It's no more a need to build a Personal Brand It is a REQUIREMENT now!! Building your digital presence is now important than ever!"
                },
                {
                    "author": "Mahbub Morshed",
                    "comment": "The moment I realized the power of personal branding...When a recruiter reached out after seeing a project showcase on my LinkedIn, highlighting the importance of public professional visibility.It's like... Being a contestant on a talent show. The more unique and well-presented your act, the more memorable you are to the judges and audience. 😊"
                }
            ]
        },
        {
            "post": "So many new solopreneurs struggle to create their first offer.They spend months or even years building something......only to find out nobody wants it.It doesn’t have to be that way.There’s a simple, often overlooked way to craft an offer your audience will love — zero guesswork involved.It’s all about:- Starting narrow- Collecting the right data- Building an offer based on real insightsThis step-by-step guide shows you exactly how to do it.- Identify the “wide” problem you can solve- Create a lead magnet that builds trust- Ask your audience what they needWith this approach, crafting a winning offer becomes much easier.No more wasted time. No more missed opportunities.Just an offer that resonates and converts.Ready to create yours?Follow these steps, and you’ll be well on your way: https://lnkd.in/efAJZbHn~~~  ✍️ What part of this was most helpful?♻️ Reshare if you found this valuable.",
            "comments": [
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "This reverse process gives faster and accurate results.The days of \"product-market fit\" are long gone.Adapt the \"idea-market-product\" fit.Start lean, grow mean.Solid advice, Justin! 🔥"
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "Getting into conversation with your audience is one way (of many) to start building in public.Your prompt to move from isolation into dialogue is dead on, Justin.The insights + actionable advice (that's tested) = GOLD. Thanks for how you continue to show up, Justin 🙏"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh step by step"
                },
                {
                    "author": "Kavin Prasath",
                    "comment": "Right offer > Right person > Right time Justin Welsh Saved it,"
                },
                {
                    "author": "Ash Roy CPA MBA",
                    "comment": "So much empathy and kindness in this approach Justin WelshAsk the audience what they need. Don't cram your offer down their throats."
                },
                {
                    "author": "Tony Pashigian, MBA",
                    "comment": "What if the offer isn't the issue? What if it's having missed the boat and not properly accumulated the audience first?I know steps 2 through infinity for analyzing a program or operations problem, coming up with a recovery plan, and executing it with a boots-on-the-ground approach.What I failed at was being on LinkedIn for 16 years without actually USING IT.I started engaging in January. So, time will tell. But \"step 1\" (the pipeline) seems to be where I didn't adequately prepare.But your post has me thinking about my offer. I know it. But have I MADE IT CLEAR?Thanks for the head-scratcher."
                },
                {
                    "author": "Mark Struczewski",
                    "comment": "When I became a solopreneur back in July 2005, I took a course from someone who said I needed to create a course. So, I created a course. I sold one. Why? Nobody told me they wanted the course. Now, I know the power of validation. It’s OK to build out a sales page to see if there’s interest but to just create a product when no one is asking for it, is silly. I know I’m not the only one that does this. Always validate. Just because you want something, doesn’t mean other people are going to give you money for it."
                },
                {
                    "author": "Tony Pashigian, MBA",
                    "comment": "Maybe this isn't one-size-fits-all, after all.Might it be the case that there are two layers that I have to offer?1) Shop floor operations turnaround for struggling manufacturing entities or pre-launch program management projects that are on an unsuccessful trajectory, AND2) Using the same knowledge and ability that I would use in the trenches for 1), above, but only in this new (to me) solopreneur world by offering affordable bite-size nuggets to INDIVIDUALS that need advice rather than ENTERPRISES that want to bring a team in to make their pain points disappear.That's a whole different ballgame."
                },
                {
                    "author": "Vlad Bronnikov",
                    "comment": "Is your carousel ridable?"
                },
                {
                    "author": "Nitish Nandwana",
                    "comment": "Humility is missing!!"
                },
                {
                    "author": "Saief Tissaoui",
                    "comment": "Yet this will ONLY work, if you have access to people willing to get your lead magnet. That's where most get stuck. You can't build this offer on 17 leads. You need a big number. That's where personal branding comes in."
                },
                {
                    "author": "Sagarika Basu",
                    "comment": "I loved the strategy of creating a lead magnet. I never thought about it. Will work on creating that."
                }
            ]
        },
        {
            "post": "Everyone's talking side hustles. But how do you start?  Here's how you build a side hustle (while employed full-time):  1. Pick a topic you can talk about for 30 minutes unprepared  2. Create daily content sharing your knowledge  3. When people ask questions, DM & schedule calls.  4. Listen for common challenges during your calls.  5. Create a short video product to address those.  6. Send it to the folks you helped on those calls.  7. Ask for testimonials in exchange for it.  8 Add the testimonials to your website.  9. Charge $50 for your new course.  10. Start charging $250 for calls.  Now you have two revenue streams:  1. A simple coaching call ($250) 2. A simple digital video product ($50)  - Make the product your low-end item. - Make the coaching call your high-end item. - Use email automation to collect more testimonials.  If people can't spend $250, direct them to the product.  At the end of the product video, share a link to schedule calls.  And around the cycle goes.  If you sell one of each, each weekday, you'd make an extra $78,000 this year.  Sell 2 of each?  Well...you get it.  Here's the complete guide to getting started for yourself: https://lnkd.in/e58rapJc  ~~~  ✍️ Have you tried this? Thoughts? ♻️ Reshare if you will!",
            "comments": [
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "The goal of a solopreneur is:- match your skill and a problem you can solve- create your unique (simple) solution to that problem- distribute based on affordability and depth of help neededDo this right and you'll have a side hustle that keeps on paying.Not easy (by any stretch of the imagination) but doable.Thanks, Justin Welsh 🔥"
                },
                {
                    "author": "Sarvam Fating",
                    "comment": "This takes me back to when I started building Notion templates - that was my 1st  side hustle 🙌Here's how I had done it:- Checked out forums to find out problems - Pick up template topics that could act as the solutions (Example - I made a Course Tracker because I noticed most people were unable to complete their courses. My tracker could help them stay committed) - Next, I designed product graphics inside Canva- Once ready, I would publish my product on Gumroad- Finally, I would distribute it on platforms like FB Groups and Product Hunt. PS - Almost nothing else can make u less tensed knowing that you have a backup income source 💪"
                },
                {
                    "author": "Nick Palasz",
                    "comment": "Absolutely, in my experience, building relationships and trust is the heart of a successful side hustle."
                },
                {
                    "author": "Abhinav Gokllani",
                    "comment": "Indeed at one point intent and awareness is overtaken by pure action."
                },
                {
                    "author": "Emmanuel Udeze",
                    "comment": "It is the level of simplicity that’s killing me.And that’s the problem with modern entrepreneurship ”Complexity”"
                }
            ]
        },
        {
            "post": "If you're an entrepreneur, why aren't you talking to your customers every single day?  It’s a cheat code for making your product or service the best it can possibly be.  When you deeply understand your clients, you can tailor your offer directly to their biggest, most expensive challenges.  And I think the most common reason more people don’t do it more often is that they just don’t know how.  To help fix that, I created a simple system that’s helped me on my journey to $7.5M+ in revenue as a one-person business:  It’s called the 30-for-30.  And it’s one of the easiest “plays” to run as an entrepreneur (even if you don’t have a big social following).  A 30-for-30 is where you offer 30 minutes of free consulting work to someone who needs it.  In exchange, you get 30 minutes of time to ask questions about their challenges so you can build a better product or service.  Here’s my full playbook for an effective 30-for-30: https://lnkd.in/es9yRBCR  ~~~  ✍️ How often do you talk to customers? ♻️ Reshare if the 30-for-30 was helpful!",
            "comments": [
                {
                    "author": "Justin Welsh",
                    "comment": "Side note: Talking to your customers isn't just helpful. It's fun. You learn so much, you get to hear what's great about your product and service, and you get to build better stuff. Why wouldn't you??"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "From every free (and paid) consult I offer I get some insights into the needs, fears, wants, and even untold expectations of the audience. The best part? You get to use the exact same phrases they use in the copy, and it resonates with them well.30-for-30 is a great way to stay in touch with discovering, validating, and identifying changing expectations of potential customers. The best way to improve the value we offer.Justin Welsh 🔥"
                },
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Customers are:feedback mechanism -> improvementsounding boards -> new ideasindustry experts -> newer issues needing urgent attentionreferrers -> do good & they return in kindGreat reminder there Justin Welsh"
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "Huge opportunity to learn. Spot on Justin!"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh customers create business, everything else comes after!"
                },
                {
                    "author": "Andrew Stafford",
                    "comment": "The best data gathering exercise you can do. Sam Walton, Walmart founder, used to walk his stores and talk to customers every week."
                },
                {
                    "author": "Ario Limin",
                    "comment": "\"Why should I? that's the job of my SDRs. Let me focus on building.\"And so, they lost touch with whom they're building for, and what they need. 🙄"
                },
                {
                    "author": "Frank Rekas",
                    "comment": "In my profession as a financial planner, the easiest way to lose clients is by not talking.  I schedule meetings on a consistent basis.  If you don't want them, you'll need to tell me.  But I'd rather be the one to reach out, instead of you."
                },
                {
                    "author": "Ubaid Ur Rehman",
                    "comment": "The real brand success is in pleasant UX.UX = Ask your customersUX = Server your customersUX = Design for your customersUnderstand better, Deliver better.More TRUST brings more sales."
                },
                {
                    "author": "John Mylant",
                    "comment": "This post highlights the importance of understanding your clients deeply, which is a principle I firmly believe in as a coach. The 30-for-30 approach resonates with my coaching philosophy of building strong relationships and offering value.In my coaching practice, I prioritize open communication and deep understanding of my clients’ challenges. This allows me to tailor my coaching services to their specific needs, helping them overcome their fears and achieve their goals.The idea of offering free consulting work aligns with my belief in providing value and building trust. It’s a great way to understand potential clients’ challenges and demonstrate how my coaching can help them.For anyone interested in experiencing this approach, feel free to reach out. I’m here to support you on your journey to a successful and fulfilling life."
                },
                {
                    "author": "Moe Nawaz",
                    "comment": "I look at Amazon product reviews to understand the pain point of customers buying products. Or Trustpilot reviewews. I learn more from the reviews than I do from some of mt private clients about their customers."
                },
                {
                    "author": "Tom Mills",
                    "comment": "Just did a survey for my newsletter, brilliant feedback that’s enabled me to enhance it to serve my readers needs 👌"
                }
            ]
        },
        {
            "post": "I had my first panic attack at age 36.  It changed my entire life.  9 months later, I walked away from my executive role as CRO.  I decided to build my own business with a different focus:  I had no interest in changing the world, building the business past 7-figures, making any grand lists, or being labeled a 'thought leader'.  And I certainly didn't want to burn out again.  Instead, I wanted to grow slowly, spend more time with my wife, work on interesting projects, travel the world, hang with my friends more frequently, and stop doing things that made me unhappy.  In a weird twist, a lot of the first list happened anyway.  Maybe there's a life lesson in there?  If you're considering the same path, here's how I rebuilt my life at 36: https://lnkd.in/eZJht696  ~~~  ✍️ Are you trading your life for money? ♻️ Reshare if this resonates with you.",
            "comments": [
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "As they say, going slow actually helps you go fast.It took me a similar burnout episode to realize this - thankfully I took heed to life's wake-up call. The fact is:- It's possible to live a meaningful life.- It's possible to make money doing what you love.- It's possible to enjoy work, family, friends - all together.All it takes is to get clarity, and a plan.But you gotta start somewhere.Start small, but do start.Thanks, Justin!"
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "It's fascinating what unfolds when we focus on who we want to BE first...and then everything else flows from there."
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh they change directions"
                },
                {
                    "author": "Sarah Bundy",
                    "comment": "I can relate to this. And panic attacks are the worst… Once you find what you’re ACTUALLY meant to do, the rest falls into place ❤️"
                },
                {
                    "author": "Leo Barbosa",
                    "comment": "Aligning our priorities/actions with our values is a must. I remember once telling an SVP about my 1st triathlon - I asked her if she would ever do something like it. She said with her role, she could never do it. It was the first time I realized maybe I don't want to be an SVP. I always think about that... I knew I wanted to have a healthy active lifestyle, and I was not going to compromise on that."
                },
                {
                    "author": "Rama Krishna Rao",
                    "comment": "I felt incomplete in a corporate job in 2017 2 years procrastinated the change March 2019, felt depression (of not able to live up to my potential) Told my boss, I need a break for 3 weeks He didn't accept Neither I listened to him Flew from Singapore to Rishikesh(India) Almost everything changed ( ha ha, yeah almost not fully ) Nov 2019, I quit the job I don't belong had ups and downs later but well worth spending for ...  Thanks for this message Justin Welsh You reminded a journey I am always proud of..."
                },
                {
                    "author": "Kim Willis",
                    "comment": "All I wanted was a lifestyle business.  As long as I was making good 6 figure money, I was happy.  It's given me the ability to travel and spend extended periods in exotic locations such as Cambodia and Vietnam.But in recent times, I've had a rethink. I'm now attracted to the idea of building something more significant—a mini-empire—or at least something that can be scaled to eight or nine figures and sold.Will it happen? Well, I haven't made the final decision. None of this is to belittle the lifestyle business idea. For most people, it's the best way to go, as it has been for me during the last 18 mostly successful years."
                },
                {
                    "author": "Ricardo Chang",
                    "comment": "Life is not about money, life is about quality time and experiences."
                },
                {
                    "author": "Jean Carlo Him",
                    "comment": "Both go hand is hand but without health we wont have wealth or lifestyle."
                },
                {
                    "author": "Mike J Lucas MBA",
                    "comment": "Work is a game with rules. Most people burn out because they play by their manager's rules. If you switch it to play by your rules you can win big avoid burnout and live a designed life. Just don't tell your boss."
                },
                {
                    "author": "Zayden N",
                    "comment": "Focus on fulfillment, not just money."
                },
                {
                    "author": "Peter M.",
                    "comment": "\"We have two lives, and the second begins when we realize we only have one.\""
                }
            ]
        },
        {
            "post": "10 years ago today, I married my best friend.She is the rock of our family.As lovely on the inside as the outside, she keeps us focused and chasing our dreams.Happy Anniversary to the one and only dog-rubbing, wine-sipping, stock-market-loving gal of my dreams, Jennifer Welsh.❤️",
            "comments": [
                {
                    "author": "Kevin Kermes",
                    "comment": "Happy Anniversary to you both! 🥂"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Happy 10th anniversary, Justin & Jennifer!"
                },
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Happy 10th Anniversary to you both Justin Welsh Jennifer Welsh Wish you both many more decades together."
                },
                {
                    "author": "Andrew Neiderman",
                    "comment": "Did you get married in Manhattan?My wife and I have a similar style photo to your first one, at least the background part. Couldn’t help but notice."
                },
                {
                    "author": "Jordan Benjamin 🧘",
                    "comment": "10 years, congrats!  What are y'all doing to celebrate?!"
                },
                {
                    "author": "Mike Liall MIPA",
                    "comment": "Where’s the fire pit from if you don’t mind me asking!?"
                },
                {
                    "author": "Jed Crystal",
                    "comment": "Congrats Justin and Jennifer! Great pics, but - how many dogs do you guys actually have?! 🐕 🐩 🐶"
                },
                {
                    "author": "Karen Hayes, PCC",
                    "comment": "Congratulations to you both.  Sending so much love xxxx"
                },
                {
                    "author": "Jason Vana",
                    "comment": "Happy Anniversary, friend! I hope you two have a fun-filled, enjoyable celebration!"
                },
                {
                    "author": "Roger Cunningham",
                    "comment": "Two wonderful people. Congrats on 10 years and cheers to the next 20+, Justin and Jennifer! Me and mine will hit our 10-year anni next spring and agree that there is nothing like doing life with your best friend. Hope your bosses give you the day off to enjoy, ha!"
                },
                {
                    "author": "Emile Languepin",
                    "comment": "Happy anniversary - looks like there is a clear correlation between number of dogs and happiness of your wife. If I trace a simple regression line, it's likely that in 10 years your posts will be about how to masterfully naviguate business with 10 dogs 🤣"
                },
                {
                    "author": "Madeline Autry",
                    "comment": "Happy anniversary, Justin and Jenn! Wishing you both the best."
                }
            ]
        },
        {
            "post": "If I were starting on LinkedIn today and wanted to grow a valuable audience of 500K+ here's what I'd do:  1/ Embrace an obsession:  When you embrace an obsession, you rarely need other external motivation.  You wake up each day with an intense desire to become the best in your specific obsession.  What can you research, break down, & share daily, that would feel like play instead of work?  2/ Develop unique knowledge:  This is the knowledge you have acquired on your unique journey, that other people want, but can’t figure out.  The best way to develop unique knowledge is by putting maximum effort into exploring your obsession.  When you do that, you learn more than the average person, and your knowledge becomes uniquely valuable to them.  3/ Challenge pre-conceived solutions:  A lot of LinkedIn creators shine a light on problems, but then they fail to create differentiated solutions.  They have the same pitch, same buzzwords, and the same jargon as everyone else.  Instead, you should leverage your unique knowledge to bring a solution that's completely different than anything on the market.  Stand out by promising and delivering on something unorthodox.  4/ Build distribution by studying people:  To turn your content into dollars, people must know you exist.  And if you have unique knowledge, you owe it to the world to get it into their hands.  Don’t copy your competition.  Instead, study human psychology, marketing, and persuasion.  And talk about that unique solution every single day online.  Build a small audience journey that takes people through discovery > trust > relationship > purchase.  5/ Scale using compounding, daily media:  Take 30 minutes each day to observe what you learned.  Tell stories, show examples, and share behind the scenes.  Content works on your behalf for hours & sometimes even days.  Classic pieces of content have lasted years or even decades.  Have at least 2 pieces of content working on your behalf in the world at all times.  TL;DR  1. Embrace your obsession 2. Develop unique knowledge 3. Challenge pre-conceived solutions 4. Build distribution by studying people 5. Scale using compounding, daily media  I cover all of this (and more) in The Operating System.  Join 20,000+ students and 50+ Top Voices here: https://lnkd.in/eqGJ6_a4  ~~~  If you got some value from this post, consider resharing ♻️ it so more people can leverage LinkedIn to the fullest.",
            "comments": [
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "If you know your audiences problems inside out, you will work out how to solve them differently. You have to play the long term game here and cannot lose patience and discipline.Solid points Justin Welsh"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "One of the best courses I've taken in 10 yrs!"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh value in words"
                },
                {
                    "author": "Travis Davis",
                    "comment": "👏🏼"
                },
                {
                    "author": "Ellis Peters",
                    "comment": "When you enjoy the time you spend working, you’re already winning"
                },
                {
                    "author": "Chimasha Induni",
                    "comment": "This is uniquely inspiring."
                },
                {
                    "author": "Zayden N",
                    "comment": "You already have the skills that you can monetize.You just need a direction. Let me show you how... In only 5 steps. 1. Pick one platformLinkedIn or Twitter — Your choice. 2. Start creating content around your skills. You will start attracting an audience that is interested in learning those skills. 3. Get 1:1 with your audience. Ask your audience what they are struggling with. • Get on a call with them. • Dm them and ask if they need any help. • Ask questions through your content. 4. Create a product/serviceNow you have a list of problems that your audience is struggling and need help with.Solve them and package it as a product/service.5. Promote shamelesslyStart promoting your product. • On your posts. • Under your posts. • In your profile's bio. • And in your every email. Looks simple, but it ain't easy."
                },
                {
                    "author": "S.L Karan Thakur 🚀",
                    "comment": "🚫 Myth: Building an audience on LinkedIn is a complex process that requires a lot of time and effort.🔎 Fact:- Building a buyer-centric profile sets the foundation for attracting your target market.- Engaging with your network by commenting, liking, and sharing their content helps you build relationships.- Transitioning to offline conversations allows you to offer personalized solutions.- Consistency in adding targeted connections and establishing yourself as an authority boosts your reputation.- Optimizing content through storytelling and educational posts enhances audience engagement.- Engaging in LinkedIn groups and forums helps you connect with industry professionals and establish thought leadership.- Sharing valuable insights and resources showcases your expertise and creates lasting relationships.- Regularly publishing thought leadership content positions you as an industry expert.💡 LinkedIn success is about providing value, engaging with your network, and showcasing your expertise"
                },
                {
                    "author": "JOE GREENWOOD",
                    "comment": "👏"
                },
                {
                    "author": "Shan Abdul Salam",
                    "comment": "Daily nuggets of inspiration ❤️❤️"
                },
                {
                    "author": "Meet Parekh - Webflow developer",
                    "comment": "I’ve been through this phase of embracing my obsession and it made me a Webflow designer and later when I tried to replicate it again, it made me a Data analyst"
                },
                {
                    "author": "Roni Benny",
                    "comment": "Developing a unique knowledge is a plus"
                }
            ]
        },
        {
            "post": "“Find yourself a mentor.”  This is the advice every business blog, career coach, and influencer under the sun preaches.  You can’t escape from it.  But I don’t think it actually works.  Because when I tried, all I had was a collection of forced relationships. I was always the taker, and they the giver.  It felt unnatural and unsustainable.  So, I tried something different:  Instead of looking for mentors, I became someone worth mentoring.  I built businesses. I did things I used to think were beyond my reach. Some projects failed, and others succeeded.  But no matter what, I consistently took action.  And, along the way, mentors started coming to me. Not the other way around.  But that’s not surprising.  Mentors (at least, the ones you want) are drawn to ambitious people with a willingness to get their hands dirty.  And who actually produce results in the process.  At the end of the day, they want a two-way value exchange — not some puppy dog looking for constant help.  So, instead of waiting around for a Mark Cuban or Jeff Bezos to land on your doorstep and teach you the path to success...  Just start doing interesting stuff.  Build. Create. Innovate. Take risks.  Overall, just be so damn interesting that those mentors you’re seeking can’t help but notice (and reach out to) you.  Here’s how: https://lnkd.in/eG-mPCqB  ~~~  ✍️ Does this resonate? Or am I way off? ♻️ Reshare if you think I got it right.",
            "comments": [
                {
                    "author": "Rajeev Mamidanna",
                    "comment": "Mentoring is also a partnership. Actually it's the mentor also getting better when the mentee shows quality.2 way street.Absolutely with you on this Justin Welsh"
                },
                {
                    "author": "Kevin Kermes",
                    "comment": "YES!Magnets to not chase, they attract.Be a magnet."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "An ancient proverb says, \"when the disciple is ready, the master appears.\"By taking consistent action we can become 'mentorable'.And then the mentoring relationship yields quicker results.Justin Welsh 🔥"
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh a mentor always doesn’t work. Many a time, you yourself don’t know what you want. And in those cases, you need self reflection, someone to talk to andmore, not a mentor who believes they know what you are going through and start preaching"
                },
                {
                    "author": "Kevin McDonnell",
                    "comment": "This is an excellent approach Justin Welsh"
                },
                {
                    "author": "Christopher Regnier",
                    "comment": "Get in the arena.That's where the mentors are anyway.Get out there.  Mess around.You'll bump into some pretty cool people."
                },
                {
                    "author": "Rose Alkamisi",
                    "comment": "That’s literally what happened to me Justin now my mentor has actually made me a partner in their business, looking after their marketing 😄"
                },
                {
                    "author": "Justin Tarr",
                    "comment": "I agree... I believe before you seek out a mentor you should prove to yourself that you're an action taker.We are programmed to think that knowledge is power. But it's not power until acted on. So if you want to do be or have something. Go do something to prove it. And by do something I mean consume a piece of information, STOP, and take action on what you learned.Mentorship only works when you take action and do what the mentor instructs. If you aren't willing to do that you are wasting the mentor's time and your time and money."
                },
                {
                    "author": "David Clements",
                    "comment": "Mentors are there to guide you, not do the work for you or spoon feed you. If you start doing the work yourself, you're already showing commitment and courage to give it your all."
                },
                {
                    "author": "Jeff Kallil",
                    "comment": "Chasing mentors is often used as an excuse. Instead of chasing mentors -- chase your dream, chase your passions, chase your vision. As you take action you will fail, learn, and grow.And as you grow the right people somehow find a way to show up in your life."
                },
                {
                    "author": "Inayah Bashir, MA, CPRW",
                    "comment": "It's all about demonstrating value through action and innovation, rather than just seeking guidance without offering anything in return."
                },
                {
                    "author": "Lesya Klymenko Liu",
                    "comment": "This take is refreshingly candid and cuts to the heart of what mentorship should truly be about. It's a wake-up call for anyone passively waiting for guidance to magically appear. Your journey highlights a critical truth: real mentorship is attracted to action, ambition, and the potential for mutual growth."
                }
            ]
        }
    ]
}